# Pandas DataFrame

A DataFrame is a two-dimensional labeled data structure.

It contains:<br>
rows + columns

Each column is a Pandas Series.

In [11]:
import pandas as pd

## Creating DataFrame from Dictionary

In [12]:
data = {
    "Name": ["Lakshay", "Amit", "Harsh"],
    "Age": [23, 25, 22],
    "City": ["Delhi", "Mumbai", "Pune"]
}

df = pd.DataFrame(data)
df

      Name  Age    City
0  Lakshay   23   Delhi
1     Amit   25  Mumbai
2    Harsh   22    Pune

## Columns & Index

In [13]:
df.columns
df.index

RangeIndex(start=0, stop=3, step=1)

## Selecting a Column (Series)

In [14]:
df["Name"]

0    Lakshay
1       Amit
2      Harsh
Name: Name, dtype: str

## Selecting Multiple Columns

In [15]:
df[["Name", "City"]]

      Name    City
0  Lakshay   Delhi
1     Amit  Mumbai
2    Harsh    Pune

## Adding New Column

In [16]:
df["Salary"] = [50000, 60000, 55000]
df

      Name  Age    City  Salary
0  Lakshay   23   Delhi   50000
1     Amit   25  Mumbai   60000
2    Harsh   22    Pune   55000

## Deleting Column

In [17]:
df.drop("Salary", axis=1)

      Name  Age    City
0  Lakshay   23   Delhi
1     Amit   25  Mumbai
2    Harsh   22    Pune

## Selecting Rows using loc

In [18]:
df.loc[0]
df.loc[1]

Name        Amit
Age           25
City      Mumbai
Salary     60000
Name: 1, dtype: object

## Selecting Rows using iloc

In [19]:
df.iloc[0]
df.iloc[1]

Name        Amit
Age           25
City      Mumbai
Salary     60000
Name: 1, dtype: object

## Basic Info

In [20]:
df.info()
df.describe()

<class 'pandas.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      str
 1   Age     3 non-null      int64
 2   City    3 non-null      str
 3   Salary  3 non-null      int64
dtypes: int64(2), str(2)
memory usage: 228.0 bytes

             Age   Salary
count   3.000000      3.0
mean   23.333333  55000.0
std     1.527525   5000.0
min    22.000000  50000.0
25%    22.500000  52500.0
50%    23.000000  55000.0
75%    24.000000  57500.0
max    25.000000  60000.0

## Conclusion

DataFrame is the main structure used for dataset manipulation.